In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
z=df['FlightNumber'].astype(str,copy=False)

In [5]:
lst=[]
for i in z:
    if i=="nan":
        i=j
    else:
        j=float(i)+int(10)
    lst.append(float(i))
print(lst)

[10045.0, 10055.0, 10065.0, 10075.0, 10085.0]

In [6]:
df['FlightNumber']=lst

In [7]:
print((df['FlightNumber'],int))

(0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64, <class 'int'>)

In [9]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [10]:
ft=list(i.split("_") for i in df['From_To'])
ft

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [11]:
df["From"]=[i[0].capitalize() for i in ft]
df[["From"]]

       From
0    London
1    Madrid
2    London
3  Budapest
4  Brussels

In [12]:
df["To"]=[i[1].capitalize() for i in ft]
df["To"]

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [13]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [14]:
df.drop(['From_To'], axis=1,inplace=True)

In [15]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [16]:
delay_1=[]
delay_2=[]
delay_3=[]
for i in df['RecentDelays']:
    if len(i)==0:
        i.extend(['NaN','NaN','NaN'])
    elif len(i)==1:
        i.extend(['NaN','NaN'])
    elif len(i)==2:
        i.extend(['NaN'])
    delay_1.append(i[0])
    delay_2.append(i[1])
    delay_3.append(i[2])

In [17]:
print(delay_1)
print(delay_2)
print(delay_3)

[23, 'NaN', 24, 13, 67]
[47, 'NaN', 43, 'NaN', 32]
['NaN', 'NaN', 87, 'NaN', 'NaN']

In [18]:
df['delay_1']=delay_1
df['delay_2']=delay_2
df['delay_3']=delay_3

In [19]:
df.drop(['RecentDelays'],axis=1,inplace=True)

In [20]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM(!),London,Paris,23,47,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24,43,87
3,10075.0,12. Air France,Budapest,Paris,13,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67,32,NaN

In [21]:
df.columns

Index(['FlightNumber', 'Airline', 'From', 'To', 'delay_1', 'delay_2',
       'delay_3'],
      dtype='object')

In [22]:
df1=pd.DataFrame(df,columns=['From', 'To', 'FlightNumber', 'delay_1', 'delay_2','delay_3', 'Airline'])

In [29]:
df1

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045.0,23,47,NaN,KLM(!)
1,Madrid,Milan,10055.0,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065.0,24,43,87,(British Airways. )
3,Budapest,Paris,10075.0,13,NaN,NaN,12. Air France
4,Brussels,London,10085.0,67,32,NaN,"""Swiss Air"""